In [8]:
import pandas as pd

In [9]:
df =  [4,8,15,16,23,42]

In [10]:
df

[4, 8, 15, 16, 23, 42]

In [11]:
l = [1,2,3,4,5,6,7,8,9,10]

In [12]:
s1 = pd.Series(l)

In [13]:
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
data = {"Name" :["Alice" , "Bob" , "Claire"],
        "Age" :[25,30,27],
        "Gender" :["Female" , "Male" , "Female"]}
df= pd.DataFrame(data,index=[1,2,3])

In [21]:
df

     Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [17]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [22]:
# Answer :In DataFrame is a 2 -Dimensional datastructure  which contains hetrogenous values in other words can have 
# different datatypes.
 # whereas in pandas.series is a one dimensional datastructure which contains homogenous values in other words can have same 
    #datatypes.

In [25]:
#for example
Sam = [1,2,3,4]
Sam = pd.Series(Sam)
Sam

0    1
1    2
2    3
3    4
dtype: int64

In [27]:
#for example of dataframe
data = {"ID": [1,2,3,4],
        "Name" :["Sam", "Man","jan","fam"]}
fn = pd.DataFrame(data,index=[1,2,3,4])

In [28]:
fn

   ID Name
1   1  Sam
2   2  Man
3   3  jan
4   4  fam

In [29]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

#There are various funtions in pandas to manipulate the data.Some common are given below:-
#Sort
#sort_search
#sort_values
#sort_index
#words_count
#len
#mean
#median
#mode
#std
#var
fn

   ID Name
1   1  Sam
2   2  Man
3   3  jan
4   4  fam

In [30]:
fn['ID'].mean()

2.5

In [31]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

# Answer: In Pandas, Series and DataFrame are mutable objects, which means that their values can be modified after creation. However, Panel is considered an immutable object, meaning that its values cannot be changed once it has been created.

In [32]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.
import pandas as pd
names = pd.Series(['Alice', 'Bob', 'Charlie'])
ages = pd.Series([25, 30, 35])
genders = pd.Series(['female', 'male', 'male'])
df = pd.DataFrame({'Name': names, 'Age': ages, 'Gender': genders})
print(df)

      Name  Age  Gender
0    Alice   25  female
1      Bob   30    male
2  Charlie   35    male